{
  "top_5_highlights": [
    {
      "id": "51a9fd50-8716-4a94-b9d5-43aeae27e747",
      "title": "Hackathon Events",
      "news": "Teams across Medius' global offices participate in a hackathon, sharing updates and photos on Viva Engage. The event sparks innovation and collaboration among the company's R&D dynamos. [Source: Viva Engage]",
      "article": "<p>Medius, a global leader in cloud-based spend management solutions, recently fueled the flames of innovation at its company-wide Hackathon. The event, a part of the #HackathonHappenings initiative, brought together employees from various offices around the world for an intense session of brainstorming and problem-solving.</p><br><p>The hackathon saw teams from the company's Paris, Jacksonville, and Tunis offices coming together to collaborate and create. Despite the geographical distance, the teams were united by their shared passion for innovation and their commitment to enhancing the company's suite of services. Even the lure of an enticing pile of burgers couldn't distract the teams from their mission. Participants were seen debating and discussing their ideas, demonstrating the intense focus and dedication that went into this event.</p><br><p>The hackathon was not just about hard work. It also featured moments of fun and camaraderie, as teams took breaks to recharge and refuel. These light-hearted moments were a testament to the strong sense of community within the Medius team.</p><br><p>From the initial brainstorming sessions to the final presentations, the Medius hackathon was a celebration of creativity and collaboration. It highlighted the company's commitment to continuous innovation and showcased the talent and dedication of its employees.</p><br><p>As the event concluded, the participants left with a sense of accomplishment, and the company gained valuable insights and ideas. The hackathon proved once again that at Medius, innovation is not just a buzzword - it's a way of life.</p>"
    },
    {
      "id": "0e38e67e-f015-45d2-9fa9-b94d7684d282",
      "title": "New Onboarding Request Features",
      "news": "Jira resolved issues reveal the addition of new features to improve the onboarding request process. This includes a command to process a staged Supplier Import and the ability to delete attachments once an onboarding request is complete. [Source: Jira]",
      "article": "<article><p>In a remarkable breakthrough, the latest release, <strong>R127</strong>, rolls out pre-payment for the first set of pilots, bringing about a significant transformation in the operation of the system. This release marks a new chapter in the area of financial technology, providing users with an enhanced level of convenience and control.</p><p>The release also sees the launch of the <strong>APA Copilot</strong> for the first set of external pilots.<br></br> This state-of-the-art feature streamlines operations and provides a seamless interface for users, offering a new level of efficiency and user-friendliness.</p><p>One of the standout features of this release is the introduction of <strong>SmartFlow</strong>, also known as Coding Suggestion. This feature is a game-changer in the non-PO based sector. In addition to the ongoing rollout phase, the release also commences the rollout of support for <strong>e-Invoices</strong>.<br></br> This addition is a significant step forward in improving the overall user experience and functionality of the system.</p><p>To ensure a smooth transition, customers are notified 1-4 weeks before the activation of SmartFlow. This advanced notice allows them to effectively manage changes within their organization, ensuring a seamless integration of the new feature. Once activated, a persisting message informs users that <em>SmartFlow has now been activated</em>, guiding them through the change.</p><br><p>Moreover, the release comes with numerous updates on various features and issues in areas such as <strong>Procurement</strong>, <strong>Supplier Portal</strong>, <strong>Support</strong>, <strong>Scheduling</strong>, <strong>Nomentia integration</strong>, and <strong>Export to excel</strong>. These enhancements aim to improve functionality, fix identified issues, and provide a more streamlined experience for users.</p><p>Accompanying the release is a comprehensive list of resolved issues from Jira. These cover a range of topics from supplier import to payment details, showcasing the commitment to improving user experience and functionality.</p><br><p>In conclusion, the R127 release brings a plethora of new features and improvements to the table, marking a significant step forward in financial technology. The introduction of pre-payment for pilots, APA Copilot for external pilots, and the revolutionary SmartFlow feature, all contribute to a more streamlined, efficient, and user-friendly system.</p></article>"
    },
    {
      "id": "bdff65df-d867-43b0-92ac-d1b2e4dbd0c7",
      "title": "Payment Details Updates",
      "news": "Improvements in payment details management have been reported in the latest Jira resolved issues. New features include a tab for Supplier with empty state and consolidation of payments to exclude items with structured reference numbers. [Source: Jira]",
      "article": "In an effort to enhance the functionality of the Payment Details feature, significant updates have been rolled out. One of these updates includes the addition of a new tab against the Supplier with an empty state. This update provides users with more flexibility and control over their payment details, allowing for more efficient management of supplier payments. This enhancement is part of an ongoing effort to continually improve and optimize the user experience. By providing a more streamlined and user-friendly interface, users can better manage their payment processes and improve their overall operational efficiency. [Source: Jira (resolved issues)]"
    },
    {
      "id": "9e22c8a3-d981-4c97-aa8f-ec84844d0ad8",
      "title": "Supplier Import Enhancements",
      "news": "Jira's resolved issues highlight enhancements in the Supplier Import process. These include the use of existing questionnaire validation for custom fields and a command to grab X supplier imports for synchronous processing. [Source: Jira]",
      "article": "In a bid to optimize Supplier Management, a series of enhancements have been made to the supplier import capabilities. These enhancements are designed to streamline the supplier onboarding process, making it more efficient and user-friendly. Among the new features is the ability to process a staged Supplier Import. This allows users to handle supplier imports more flexibly and efficiently, thereby reducing the time and effort required to onboard new suppliers. In addition, the system now utilizes existing questionnaire validation for custom fields. This feature improves the accuracy and reliability of the data imported into the system. By validating custom fields against existing questionnaires, the system ensures that the imported data is consistent with the established data structures. These enhancements illustrate the ongoing commitment to improving the user experience and functionality of Supplier Management. With these new features, users can expect a more seamless and efficient supplier onboarding process. [Source: Jira (resolved issues), Confluence]"
    },
    {
      "id": "e4659dc3-b9bf-464d-aab6-2e986c15decc",
      "title": "MediusGo Success",
      "news": "A post on Viva Engage highlights the success of MediusGo, with an impressive customer migration to Azure, reduced invoice processing times, and a new release of functionalities. [Source: Viva Engage]",
      "article": "MediusGo, the leading invoice automation solution, has achieved a significant milestone with an automation rate of over 90% for client Skellefteå Kraft. This achievement demonstrates the effectiveness of MediusGo's automation capabilities, offering clients a streamlined and efficient invoice processing solution. Skellefteå Kraft has been able to increase its automation rate through analyzing reasons for invoice hold-ups in the connect/analyze stages and making necessary changes. By working with more of their top suppliers to further increase automation, Skellefteå Kraft is setting a high bar for other companies to aim for. This achievement is a testament to MediusGo's commitment to delivering high-quality, efficient solutions to its clients. [Source: Viva Engage]"
    }
  ],
  "categories_and_highlights": {
    "Product Updates": [
      {
        "id": "46f7b5c4-af42-4669-8717-bf2df41c0d13",
        "title": "Onboarding Request Features",
        "news": "New features have been added to improve the onboarding request process, including a command to process a staged Supplier Import and the ability to delete attachments once a request is complete. [Source: Jira]"
      },
      {
        "id": "f35aefb1-4460-4e11-bd9a-eb8004165e39",
        "title": "Payment Details Management",
        "news": "Improvements have been implemented in payment details management, including a new tab for Supplier with empty state and consolidation of payments to exclude items with structured reference numbers. [Source: Jira]"
      },
      {
        "id": "a2de6f69-fcb8-47cf-a174-14a642660d1e",
        "title": "Supplier Import Enhancements",
        "news": "The Supplier Import process has been enhanced with the use of existing questionnaire validation for custom fields and a command to grab X supplier imports for synchronous processing. [Source: Jira]"
      }
    ],
    "Company News": [
      {
        "id": "9fb7cc3d-0d7f-4da3-b1f5-c85c8a72e593",
        "title": "MediusGo Success",
        "news": "MediusGo celebrates a significant milestone, with an impressive customer migration to Azure, reduced invoice processing times, and a new release of functionalities. [Source: Viva Engage]"
      },
      {
        "id": "38b0515d-2f21-4c25-8b2e-11f858a208e2",
        "title": "Hackathon Events",
        "news": "Teams across Medius' global offices participate in a hackathon, sharing updates and photos on Viva Engage. The event sparks innovation and collaboration among the company's R&D dynamos. [Source: Viva Engage]"
      },
      {
        "id": "f35c8c5a-99c4-48bb-950f-3ee4c24ee11d",
        "title": "Employee Anniversaries",
        "news": "Several Medius employees celebrate their work anniversaries this week, demonstrating the company's commitment to its staff and their professional growth. [Source: Viva Engage]"
      }
    ],
    "Internal Events": [
      {
        "id": "1e99908b-d184-44b4-ba88-69a1b5f31825",
        "title": "HackathonHappenings",
        "news": "Medius' global offices participate in a hackathon, with teams sharing their progress and experiences on Viva Engage. The event promotes innovation and fosters a sense of community within the company. [Source: Viva Engage]"
      },
      {
        "id": "b44315c5-b4d5-4d0e-8e12-3b6718a99e9b",
        "title": "Internal Release Notes",
        "news": "Medius releases internal notes detailing new features and bug fixes in its APA and Procurement software. The company is committed to continuous improvement and keeping its staff updated on product developments. [Source: Confluence]"
      },
      {
        "id": "84b2ef47-b165-4599-a5fc-6a340a0df174",
        "title": "PS Leadership Event",
        "news": "The Medius UK team hosts a PS leadership event in Manchester, providing an opportunity for team members to connect and share ideas. The event highlights the company's commitment to fostering a collaborative culture. [Source: Viva Engage]"
      }
    ]
  }
}
